app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('wNqbsgPDnEhjX5gT3VyR', NULL, '2010-06-16 01:24:41', '625191a487befb2b3f54e403f1c25585f96e24dfdb0a29e704223791e9339deed948b617c8207fec80698519bbaf686a532a6ecbc5d16ec6b3f3212016209fd5', 'PiY-0C9s4D0FWu-8Yr8A', '2010-06-16 01:24:41', 0, NULL, 'rbqzZLqvXsJWjzXeDtA-', NULL, 'efdd47fcf061c81af461e1fd9e63232df12985336e484afcabb293df492a2db2c5ffe21060434960da73209c3c1c99d4f5bffb097ee1ed84ee6a0e7aa3056a9a', 0, NULL, 'clayton', NULL, 'clayton@integrumtech.com')
---
  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save