app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('4i7jhsb48iR1X1k6Wrc-', '2010-06-16 01:38:36', '2010-06-16 01:38:36', 'b176c98fd849a4d1671f4cff68a876ec11ee1b8b9e097889167900a60c99d93819e6f2292dfafe6e75b34a511068ee081b769278e61cacd9394525acfea671f7', 'RcZXL-x5QpEytUdefjld', '2010-06-16 01:38:36', 0, '127.0.0.1', 'v-RqC1thmgke6VRxdIMy', '2010-06-16 01:38:36', '3d46b2eae25bb1c1aef98f8eaf4e2f9640e82665ad153a1ab2220a014939b2f3e35dd69cd66675818276a35521a6ab29b533dbdca0c02623eba15cc1b489576d', 1, NULL, 'Andrew', NULL, 'andrew.bowerman@integrumtech.com')